# Core environment
brew "chezmoi"
brew "mise"
brew "sheldon"

# Shell
brew "zsh"

# Version control
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gh"
brew "glab"
brew "ghq"

# Editors
brew "vim"
brew "neovim"

# GPG / SSH
brew "gnupg"
brew "pinentry-mac"
brew "pass"

# CLI tools
brew "gomi"

# Fonts
cask "font-udev-gothic"
