{
  "buckets": [
    { "Name": "main",   "Source": "https://github.com/ScoopInstaller/Main" },
    { "Name": "extras", "Source": "https://github.com/ScoopInstaller/Extras" }
  ],
  "apps": [
    { "Name": "chezmoi", "Source": "main" },
    { "Name": "mise",    "Source": "main" },

    { "Name": "vcredist2022", "Source": "extras" },

    { "Name": "git",     "Source": "main" },
    { "Name": "git-lfs", "Source": "main" },
    { "Name": "ghq",     "Source": "main" },
    { "Name": "neovim",  "Source": "main" },
    { "Name": "wezterm", "Source": "extras" },
    { "Name": "gpg4win", "Source": "extras" },

    { "Name": "msys2", "Source": "main" },

    { "Name": "lua",  "Source": "main" },
    { "Name": "ruby", "Source": "main" }
  ]
}
